-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/David Wasser/Dropbox/David/Research/btb/JPubE-105473-Replication-Package/map/county_maps_creation.log
  log type:  text
 opened on:  18 Sep 2025, 05:11:06

. 
. *** the following dataset is made in "$build/btb_annual_laws.do": ***
. use "$analysis_data/btb_annual_laws_map.dta", clear

. 
. * Drop Puerto Rico
. drop if (stateFIPS == 72)
(759 observations deleted)

. 
. * Create BTBever variable
. bys metroFIPS: egen BTBever = max(BTB_eos)

. 
. gen county = stateFIPS*1000 + fips_county_code

. 
. * merge in maptile's county file to get non-MSA counties
. merge m:1 county using "$maptile/county2014_database.dta"
(variable county was float, now double to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         1,987
        from master                        11  (_merge==1)
        from using                      1,976  (_merge==2)

    Matched                            12,826  (_merge==3)
    -----------------------------------------

. * bedford city, va only in master
. 
. replace stateFIPS = statefips if _merge == 2
(1,976 real changes made)

. replace fips_county_code = county-stateFIPS*1000 if _merge == 2
(1,976 real changes made)

. replace year = 2014 if _merge == 2
(1,976 real changes made)

. replace BTBever = 0 if _merge == 2
(1,976 real changes made)

. 
. bys stateFIPS: egen BTBstate = max(btb_state_eos) 

. 
. tab stateFIPS BTBstate

MSA-state- |
  county's |       BTBstate
state fips |         0          1 |     Total
-----------+----------------------+----------
         1 |       357          0 |       357 
         2 |        59          0 |        59 
         4 |        95          0 |        95 
         5 |       275          0 |       275 
         6 |         0        428 |       428 
         8 |         0        234 |       234 
         9 |         0         78 |        78 
        10 |         0         33 |        33 
        11 |        11          0 |        11 
        12 |       507          0 |       507 
        13 |       899          0 |       899 
        15 |         0         35 |        35 
        16 |       164          0 |       164 
        17 |         0        502 |       502 
        18 |       532          0 |       532 
        19 |       309          0 |       309 
        20 |       295          0 |       295 
        21 |       470          0 |       470 
        22 |       414          0 |       414 
        23 |        66          0 |        66 
        24 |         0        214 |       214 
        25 |         0        124 |       124 
        26 |       343          0 |       343 
        27 |         0        357 |       357 
        28 |       252          0 |       252 
        29 |       455          0 |       455 
        30 |       106          0 |       106 
        31 |         0        223 |       223 
        32 |        57          0 |        57 
        33 |        40          0 |        40 
        34 |       231          0 |       231 
        35 |         0        103 |       103 
        36 |       442          0 |       442 
        37 |       560          0 |       560 
        38 |       113          0 |       113 
        39 |       468          0 |       468 
        40 |       257          0 |       257 
        41 |       166          0 |       166 
        42 |       437          0 |       437 
        44 |         0         55 |        55 
        45 |       306          0 |       306 
        46 |       146          0 |       146 
        47 |       515          0 |       515 
        48 |     1,074          0 |     1,074 
        49 |       129          0 |       129 
        50 |        44          0 |        44 
        51 |       944          0 |       944 
        53 |       249          0 |       249 
        54 |       265          0 |       265 
        55 |       332          0 |       332 
        56 |        43          0 |        43 
-----------+----------------------+----------
     Total |    12,427      2,386 |    14,813 

. replace BTBever = BTBstate if _merge == 2
(307 real changes made)

. 
. 
. * Only keep necessary variables 
. keep metroFIPS msa_name fips_county_code county BTBever

. collapse (first) BTBever, by(metroFIPS msa_name fips_county_code county)

. 
. rename metroFIPS cbsa2013

. 
. *** appendix figure a.1: map of MSAs and states covered by BTB by December 2014 (end of sample period) ***
. maptile BTBever, geo(county2014) cutvalues(0(1)1) twopt(legend(off)) fcolor(""255 255 255" "90 90 90"") ndfcolor(white) stateoutline(vthin)

. 
. graph export "$out/BTB_msas.eps", replace
file C:/Users/David Wasser/Dropbox/David/Research/btb/JPubE-105473-Replication-Package/analyze/out/BTB_msas.eps saved as EPS format

. graph export "$out/figureA1.pdf", replace
file C:/Users/David Wasser/Dropbox/David/Research/btb/JPubE-105473-Replication-Package/analyze/out/figureA1.pdf saved as PDF format

. 
. log close
      name:  <unnamed>
       log:  C:/Users/David Wasser/Dropbox/David/Research/btb/JPubE-105473-Replication-Package/map/county_maps_creation.log
  log type:  text
 closed on:  18 Sep 2025, 05:11:10
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
